//
// Created by redmiX on 2025/11/25.
//

#ifndef RTOS_PROJECT_CIRCULAR_BUFFER_H
#define RTOS_PROJECT_CIRCULAR_BUFFER_H
//******************************** Includes *********************************//
#include <stdint.h>

//******************************** Includes *********************************//
//---------------------------------------------------------------------------//
//******************************** Defines **********************************//
// MPU6050数据包大小定义
#define MPU6050_DATA_PACKET_SIZE    14  // 加速度(6) + 温度(2) + 陀螺仪(6) = 14字节
//******************************** Defines **********************************//
//---------------------------------------------------------------------------//
//******************************** Typedefs *********************************//
typedef struct circular_buffer circular_buffer_t;
typedef struct circular_buffer
{
    uint8_t *buffer;  // 缓冲区的实际内存地址（动态分配）
    uint8_t rflag;    // 读指针：标记当前可读数据的槽位索引（0 ~ size-1）
    uint8_t wflag;    // 写指针：标记当前可写数据的槽位索引（0 ~ size-1）
    // 函数指针：获取写缓冲区地址（用于DMA/CPU写入数据）
    uint8_t *(*pf_get_wbuffer_addr)(struct circular_buffer *);
    // 函数指针：获取读缓冲区地址（用于应用层读取数据）
    uint8_t *(*pf_get_rbuffer_addr)(struct circular_buffer *);
    // 函数指针：写完成回调（数据写入后更新写指针）
    void (*pf_data_writed)(struct circular_buffer *);
    // 函数指针：读完成回调（数据读取后更新读指针）
    void (*pf_data_readed)(struct circular_buffer *);
    uint8_t size;     // 缓冲区的“槽位数量”（每个槽位存储1帧14字节数据）
}circular_buffer_t;

extern circular_buffer_t mpu_circular_buffer;
//******************************** Typedefs *********************************//
//---------------------------------------------------------------------------//
//**************************** Interface Structs ****************************//
//**************************** Interface Structs ****************************//
//---------------------------------------------------------------------------//
//******************************** Classes **********************************//
//******************************** Classes **********************************//
//---------------------------------------------------------------------------//
//******************************** 函数声明 ***********************************//
void buffer_init(circular_buffer_t *buffer, uint8_t size);
//******************************** 函数声明 ***********************************//

#endif //RTOS_PROJECT_CIRCULAR_BUFFER_H